app/controllers/school_classes_controller.rb

    def index
        @classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

    def create
        @class = SchoolClass.new(school_class_params(:title, :room_number))
        @class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Python "], ["room_number", 2], ["created_at", "2020-09-21 22:42:23.041864"], ["updated_at", "2020-09-21 22:42:23.041864"]]

    def edit
        @class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def update
        @class = SchoolClass.find(params[:id])
        @class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 10], ["updated_at", "2020-09-22 01:34:27.700354"], ["id", 5]]