app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jordan Edited"], ["updated_at", "2020-09-22 01:52:14.791396"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student = Student.update(student_params(:first_name, :last_name))